{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Full-Time",
      "description": "We are seeking a talented Front-End Developer to join our team in Nairobi, Kenya. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, with experience working with modern JavaScript frameworks such as React or Angular.",
      "location": "Nairobi, Kenya",
      "salary": 110000,
      "company": {
        "name": "NewTek Kenya",
        "description": "NewTek Kenya is a leading technology company specializing in web development and digital solutions. We pride ourselves on delivering high-quality products and services to our clients while fostering a collaborative and innovative work environment.",
        "contactEmail": "contact@newtek.co.ke",
        "contactPhone": "+254-700-000000"
      }
    },
    {
      "id": "2",
      "title": "Front-End Engineer (React & Redux)",
      "type": "Full-Time",
      "location": "Mombasa, Kenya",
      "description": "Join our team as a Front-End Developer in coastal Mombasa. We are looking for a motivated individual with a passion for crafting beautiful and responsive web applications. Experience with UI/UX design principles and a strong attention to detail are highly desirable.",
      "salary": 110000,
      "company": {
        "name": "Veneer Solutions KE",
        "description": "Veneer Solutions KE is a creative agency specializing in digital design and development. Our team is dedicated to pushing the boundaries of creativity and innovation to deliver exceptional results for our clients.",
        "contactEmail": "careers@veneersolutions.co.ke",
        "contactPhone": "+254-700-111111"
      }
    },
    {
      "id": "3",
      "title": "React.js Developer",
      "type": "Full-Time",
      "location": "Nakuru, Kenya",
      "description": "Are you passionate about front-end development? Join our team in vibrant Nakuru, working on exciting projects that make a difference. We offer competitive compensation and a collaborative work environment where your ideas are valued.",
      "salary": 110000,
      "company": {
        "name": "Dolor Cloud KE",
        "description": "Dolor Cloud KE is a leading technology company specializing in digital solutions for businesses of all sizes. With a focus on innovation and customer satisfaction, we are committed to delivering cutting-edge products and services.",
        "contactEmail": "hr@dolorcloud.co.ke",
        "contactPhone": "+254-700-222222"
      }
    },
    {
      "id": "4",
      "title": "React Front-End Developer (Part-Time)",
      "type": "Part-Time",
      "description": "Join our team as a Part-Time Front-End Developer in Nairobi with flexible hours and the option to work remotely. We are looking for a self-motivated individual with a passion for creating engaging user experiences.",
      "location": "Nairobi, Kenya",
      "salary": 65000,
      "company": {
        "name": "Alpha Elite KE",
        "description": "Alpha Elite KE is a dynamic startup specializing in digital marketing and web development. We are committed to fostering a diverse and inclusive workplace where creativity and innovation thrive.",
        "contactEmail": "jobs@alphaelite.co.ke",
        "contactPhone": "+254-700-333333"
      }
    },
    {
      "id": "5",
      "title": "Full Stack React Developer",
      "type": "Full-Time",
      "description": "Exciting opportunity for a Full-Time Front-End Developer in Nairobi. We are seeking a talented individual with a passion for building elegant and scalable web applications. Join our team and make an impact!",
      "location": "Nairobi, Kenya",
      "salary": 150000,
      "company": {
        "name": "Browning Tech KE",
        "description": "Browning Tech KE is a rapidly growing technology company specializing in e-commerce solutions. We offer a dynamic and collaborative work environment where employees are encouraged to think creatively and innovate.",
        "contactEmail": "recruitment@browningtech.co.ke",
        "contactPhone": "+254-700-444444"
      }
    },
    {
      "id": "6",
      "title": "React Native Developer",
      "type": "Full-Time",
      "description": "Join our team as a Front-End Developer in Kisumu, Kenya. We are looking for a skilled and enthusiastic individual to help us create innovative web and mobile solutions. Competitive salary and benefits package available.",
      "location": "Kisumu, Kenya",
      "salary": 190000,
      "company": {
        "name": "Port Solutions KE",
        "description": "Port Solutions KE specializes in software development and digital marketing. We provide our clients with cutting-edge solutions and our employees with a supportive and rewarding work environment.",
        "contactEmail": "talent@portsolutions.co.ke",
        "contactPhone": "+254-700-555555"
      }
    },
    {
      "id": "7",
      "title": "Junior React Developer",
      "type": "Full-Time",
      "location": "Nairobi, Kenya",
      "description": "Entry level React Developer position for fresh graduates with some experience or internships. Great learning environment with mentorship opportunities.",
      "salary": 70000,
      "company": {
        "name": "Kenya Tech Innovators",
        "description": "Kenya Tech Innovators is a local tech startup committed to nurturing young talent and delivering innovative digital solutions.",
        "contactEmail": "hr@kenyatechinnovators.co.ke",
        "contactPhone": "+254-700-666666"
      }
    }
  ]
}